In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
labels = ['Felix','Hud','Abiral']
my_list = [1,4,5]
arr = np.array([1,4,5])
d = {'Felix':1,'Hud':4,'Abiral':5}

In [3]:
pd.Series(data=my_list)

0    1
1    4
2    5
dtype: int64

In [4]:
print("Familarity With Python")
pd.Series(data=my_list,index=labels)

Familarity With Python

Felix     1
Hud       4
Abiral    5
dtype: int64

In [5]:
pd.Series(data = arr)

0    1
1    4
2    5
dtype: int32

In [6]:
pd.Series(arr,labels)

Felix     1
Hud       4
Abiral    5
dtype: int32

In [7]:
ser = pd.Series(d)
ser

Felix     1
Hud       4
Abiral    5
dtype: int64

In [8]:
pd.Series(data=labels)

0     Felix
1       Hud
2    Abiral
dtype: object

In [9]:
ser['Hud']

4

In [10]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])        
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [11]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])     
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [12]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [13]:
ser1.add(ser2)

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [14]:
df = pd.DataFrame(randn(5,4),index=('A', 'B' ,'C','D','E'),columns='W X Y Z'.split())

In [15]:
df

          W         X         Y         Z
A -1.476043  1.485235 -0.211020 -1.144145
B  0.079827 -0.929978  1.525610 -0.955262
C  0.315665  0.654804 -1.159317 -0.559033
D  0.281623 -1.024596 -1.384898 -1.378194
E -0.489069 -0.518452  1.692027  0.292272

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
type(df['W'])

pandas.core.series.Series

In [18]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A -1.476043  1.485235 -0.211020 -1.144145 -1.687063
B  0.079827 -0.929978  1.525610 -0.955262  1.605437
C  0.315665  0.654804 -1.159317 -0.559033 -0.843652
D  0.281623 -1.024596 -1.384898 -1.378194 -1.103275
E -0.489069 -0.518452  1.692027  0.292272  1.202958

In [19]:
df.drop('new',axis=1)

          W         X         Y         Z
A -1.476043  1.485235 -0.211020 -1.144145
B  0.079827 -0.929978  1.525610 -0.955262
C  0.315665  0.654804 -1.159317 -0.559033
D  0.281623 -1.024596 -1.384898 -1.378194
E -0.489069 -0.518452  1.692027  0.292272

In [20]:
df

          W         X         Y         Z       new
A -1.476043  1.485235 -0.211020 -1.144145 -1.687063
B  0.079827 -0.929978  1.525610 -0.955262  1.605437
C  0.315665  0.654804 -1.159317 -0.559033 -0.843652
D  0.281623 -1.024596 -1.384898 -1.378194 -1.103275
E -0.489069 -0.518452  1.692027  0.292272  1.202958

In [21]:
df.drop('new',axis=1,inplace=True)

In [22]:
df

          W         X         Y         Z
A -1.476043  1.485235 -0.211020 -1.144145
B  0.079827 -0.929978  1.525610 -0.955262
C  0.315665  0.654804 -1.159317 -0.559033
D  0.281623 -1.024596 -1.384898 -1.378194
E -0.489069 -0.518452  1.692027  0.292272

In [23]:
df.drop('C',axis=0)

          W         X         Y         Z
A -1.476043  1.485235 -0.211020 -1.144145
B  0.079827 -0.929978  1.525610 -0.955262
D  0.281623 -1.024596 -1.384898 -1.378194
E -0.489069 -0.518452  1.692027  0.292272

In [24]:
df

          W         X         Y         Z
A -1.476043  1.485235 -0.211020 -1.144145
B  0.079827 -0.929978  1.525610 -0.955262
C  0.315665  0.654804 -1.159317 -0.559033
D  0.281623 -1.024596 -1.384898 -1.378194
E -0.489069 -0.518452  1.692027  0.292272

In [25]:
# df.loc?

In [26]:
df

          W         X         Y         Z
A -1.476043  1.485235 -0.211020 -1.144145
B  0.079827 -0.929978  1.525610 -0.955262
C  0.315665  0.654804 -1.159317 -0.559033
D  0.281623 -1.024596 -1.384898 -1.378194
E -0.489069 -0.518452  1.692027  0.292272

In [27]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [28]:
df.loc['A']

W   -1.476043
X    1.485235
Y   -0.211020
Z   -1.144145
Name: A, dtype: float64

In [29]:
df.loc['B','Y']

1.525609854027552

In [30]:
df.loc[['A','B'],['W']]

          W
A -1.476043
B  0.079827

In [31]:
df.loc['A':'D','W':'Y']

          W         X         Y
A -1.476043  1.485235 -0.211020
B  0.079827 -0.929978  1.525610
C  0.315665  0.654804 -1.159317
D  0.281623 -1.024596 -1.384898

In [32]:
df.loc[df.W>0,:]

          W         X         Y         Z
B  0.079827 -0.929978  1.525610 -0.955262
C  0.315665  0.654804 -1.159317 -0.559033
D  0.281623 -1.024596 -1.384898 -1.378194

In [33]:
df.loc[:,'Y']

A   -0.211020
B    1.525610
C   -1.159317
D   -1.384898
E    1.692027
Name: Y, dtype: float64

In [34]:
df

          W         X         Y         Z
A -1.476043  1.485235 -0.211020 -1.144145
B  0.079827 -0.929978  1.525610 -0.955262
C  0.315665  0.654804 -1.159317 -0.559033
D  0.281623 -1.024596 -1.384898 -1.378194
E -0.489069 -0.518452  1.692027  0.292272

In [35]:
df.iloc[2]

W    0.315665
X    0.654804
Y   -1.159317
Z   -0.559033
Name: C, dtype: float64

In [36]:
df.iloc[[2,4],1]

C    0.654804
E   -0.518452
Name: X, dtype: float64

In [37]:
list(df.W >0)

[False, True, True, True, False]

In [38]:
df.iloc[list(df.W >0),:]

          W         X         Y         Z
B  0.079827 -0.929978  1.525610 -0.955262
C  0.315665  0.654804 -1.159317 -0.559033
D  0.281623 -1.024596 -1.384898 -1.378194

In [39]:
df>0

       W      X      Y      Z
A  False   True  False  False
B   True  False   True  False
C   True   True  False  False
D   True  False  False  False
E  False  False   True   True

In [40]:
df[df>0]

          W         X         Y         Z
A       NaN  1.485235       NaN       NaN
B  0.079827       NaN  1.525610       NaN
C  0.315665  0.654804       NaN       NaN
D  0.281623       NaN       NaN       NaN
E       NaN       NaN  1.692027  0.292272

In [41]:
df[df['W']>0]

          W         X         Y         Z
B  0.079827 -0.929978  1.525610 -0.955262
C  0.315665  0.654804 -1.159317 -0.559033
D  0.281623 -1.024596 -1.384898 -1.378194

In [42]:
df

          W         X         Y         Z
A -1.476043  1.485235 -0.211020 -1.144145
B  0.079827 -0.929978  1.525610 -0.955262
C  0.315665  0.654804 -1.159317 -0.559033
D  0.281623 -1.024596 -1.384898 -1.378194
E -0.489069 -0.518452  1.692027  0.292272

In [43]:
df[df['W']>0]['Y']

B    1.525610
C   -1.159317
D   -1.384898
Name: Y, dtype: float64

In [44]:
df[df['W']>0][['Y','X']]

          Y         X
B  1.525610 -0.929978
C -1.159317  0.654804
D -1.384898 -1.024596

In [45]:
df[(df['W']>0) & (df['Y'] <0)]

          W         X         Y         Z
C  0.315665  0.654804 -1.159317 -0.559033
D  0.281623 -1.024596 -1.384898 -1.378194

In [46]:
df.reset_index(inplace = True)

In [47]:
df

  index         W         X         Y         Z
0     A -1.476043  1.485235 -0.211020 -1.144145
1     B  0.079827 -0.929978  1.525610 -0.955262
2     C  0.315665  0.654804 -1.159317 -0.559033
3     D  0.281623 -1.024596 -1.384898 -1.378194
4     E -0.489069 -0.518452  1.692027  0.292272

In [48]:
df.set_index('index',inplace=True)

In [49]:
df

              W         X         Y         Z
index
A     -1.476043  1.485235 -0.211020 -1.144145
B      0.079827 -0.929978  1.525610 -0.955262
C      0.315665  0.654804 -1.159317 -0.559033
D      0.281623 -1.024596 -1.384898 -1.378194
E     -0.489069 -0.518452  1.692027  0.292272

In [50]:
df = pd.DataFrame({'CE':[1,2,0],
                  'CS':[5,0,2],
                  'EE':[11,20,0],
                  'Pharmacy':[23,15,np.nan]},index=['C++','Math','Electrical'])

In [51]:
df

            CE  CS  EE  Pharmacy
C++          1   5  11      23.0
Math         2   0  20      15.0
Electrical   0   2   0       NaN

In [52]:
df.dropna()

      CE  CS  EE  Pharmacy
C++    1   5  11      23.0
Math   2   0  20      15.0

In [53]:
df.dropna(axis=1)

            CE  CS  EE
C++          1   5  11
Math         2   0  20
Electrical   0   2   0

In [54]:
df.dropna(thresh=2)

            CE  CS  EE  Pharmacy
C++          1   5  11      23.0
Math         2   0  20      15.0
Electrical   0   2   0       NaN

In [55]:
df.fillna(value='FILL VALUE')

            CE  CS  EE    Pharmacy
C++          1   5  11        23.0
Math         2   0  20        15.0
Electrical   0   2   0  FILL VALUE

In [56]:
df['Pharmacy'].fillna(value=df['Pharmacy'].mean(),inplace=True)

In [57]:
df

            CE  CS  EE  Pharmacy
C++          1   5  11      23.0
Math         2   0  20      15.0
Electrical   0   2   0      19.0

In [58]:
data = {'Subject':['DBMS','DBMS','MCSC','MCSC','DIFF','DIFF'],
       'Instructor':['Santosh','Nabin','Gokul','Ram','Saraswoti','Khim'],
       'Assignments':[10,2,4,5,6,4]}

In [59]:
df = pd.DataFrame(data)
df

  Subject Instructor  Assignments
0    DBMS    Santosh           10
1    DBMS      Nabin            2
2    MCSC      Gokul            4
3    MCSC        Ram            5
4    DIFF  Saraswoti            6
5    DIFF       Khim            4